/* ************************************************************************** */
/*
 * 関数名   StdChr_Isupper
 * 機能     文字が英大文字（A～Z）か検査
 * 引数     型          変数名          説明
 *          uint32t     aC              対象文字
 * 戻り値   uint32t     tRet
 * 説明     文字aCが英大文字（A～Z）なら真（0以外の数）を返す
 *          文字aCが英大文字以外なら偽（0）を返す
 */
/* ************************************************************************** */
uint32t StdChr_Isupper(uint32t aC)
{
    /* 戻り値の初期化 */
    uint32t tRet = DEF_STDCHR_0;

    /* ここに実装してください。 */
    if(aC >= 'A' && aC <= 'Z') {
        return 0x01;
    } else {
        return tRet;
    }

    return tRet;
}